<details><summary>Show Plan</summary>

```

terraform
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
data.github_release.latest_release: Reading...
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=85]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=0:staging_verify]
data.github_release.latest_release: Read complete after 0s [id=90835266]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-586fa3aa-5a55-4d4e-b677-c0b6b993fea3]
module.ecs.data.aws_iam_policy_document.otel: Reading...
module.ecs.data.aws_iam_policy_document.otel: Read complete after 0s [id=1623705645]
module.dns.data.aws_route53_zone.hosted_zone: Reading...
data.aws_ecr_repository.repository: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0831db520b7ce0fce]
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging-verify_logs]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a3731d74832a2230]
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/5000bccc-0f2d-432e-a688-0ca51a821cfd]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.aws_iam_policy.otel: Refreshing state... [id=arn:aws:iam::898587786287:policy/staging-verify-otel]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging-verify-ecs-task-execution-role]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_fetch_ghcr_secret_policy: Refreshing state... [id=staging-verify-ecs-task-execution-role-20230125102837389900000005]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging-verify-ecs-task-execution-role-20230125102837390400000006]
module.ecs.aws_iam_role_policy_attachment.ssm_read_only_policy: Refreshing state... [id=staging-verify-ecs-task-execution-role-20230125102836599400000001]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging-verify-ecs-task-execution-role-20230125102836851100000004]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_xray_policy: Refreshing state... [id=staging-verify-ecs-task-execution-role-20230125102836838900000003]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging-verify-ecs-task-execution-role-20230125102836611600000002]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging-verify]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 1s [id=Z05475933U67RRYWNMJX5]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z05475933U67RRYWNMJX5__a20e2ba642a1981cd40943c9f65369d2.staging.verify.walletconnect.com._CNAME]
data.aws_ecr_repository.repository: Read complete after 1s [id=bouncer]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=86]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-09d7dc916b9f7d698]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-00d455cf4c822c44a]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-verify-target-group/521a938df3b3e108]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-00184fa2b3610a7dd]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03eef038b326b965c]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0a60f1f9ad9411a16]
module.ecs.aws_security_group.lb_ingress: Refreshing state... [id=sg-006fdafde4fb520f6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0cb8399f7a4f000c2]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-013bb0b4108fceb35]
module.redis.aws_security_group.service_security_group: Refreshing state... [id=sg-0ad09ffed48972f67]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-094cd63118c7d693d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09629110e5ba174e6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0327de12f74b61dca]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0aba7479f027fd8e1]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0954b80eda72717f8]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-03280999ce1081122]
module.redis.aws_elasticache_subnet_group.private_subnets: Refreshing state... [id=verify-staging-verify-private-subnet-group]
module.ecs.aws_security_group.app_ingress: Refreshing state... [id=sg-0ba8aa7a32ad3772e]
module.ecs.aws_lb.application_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/staging-verify-load-balancer/02c37dc9f5009c09]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09629110e5ba174e61080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09edcc2c2e1312316]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-064db9a92995a3edf]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-010155a0e463e12ac]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-013bb0b4108fceb351080289494]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-verify-load-balancer/02c37dc9f5009c09/d06576a2571142c2]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z05475933U67RRYWNMJX5_staging.verify.walletconnect.com_A]
module.ecs.aws_lb_listener.listener-http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/staging-verify-load-balancer/02c37dc9f5009c09/89008b30e3390b5b]
module.redis.aws_elasticache_cluster.cache: Refreshing state... [id=verify-staging-verify]
module.ecs.aws_ecs_task_definition.app_task_definition: Refreshing state... [id=staging-verify]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging-verify/staging-verify-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecs.aws_ecs_task_definition.app_task_definition has been deleted
  - resource "aws_ecs_task_definition" "app_task_definition" {
      - arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-verify:13" -> null
        id                       = "staging-verify"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-verify/staging-verify-service"
        name                               = "staging-verify-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-verify:14" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition will be created
  + resource "aws_ecs_task_definition" "app_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::898587786287:role/staging-verify-ecs-task-execution-role"
      + family                   = "staging-verify"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Application"      = "verify"
          + "Env"              = "staging"
          + "EnvironmentGroup" = "walletconnect"
          + "Name"             = "verify"
          + "ProvisionedBy"    = "Terraform"
        }
      + task_role_arn            = "arn:aws:iam::898587786287:role/staging-verify-ecs-task-execution-role"

      + runtime_platform {
          + operating_system_family = "LINUX"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and 5 more similar warnings elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on provider.tf line 5, in provider "aws":
   5:   skip_get_ec2_platforms      = true

With the retirement of EC2-Classic the skip_get_ec2_platforms attribute has
been deprecated and will be removed in a future version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*